alert('Проверьте консоль. В ней выставлена самооценка. Также прошу обратить внимание, что Flickr API просто ужасен');
console.log(`===============

1. Поисковый алгоритм flickr api отвратителен. Чтобы проверить, что поиск по тегам работает, введите имя какой-нибудь знаменитости. Вам выдадут должны выдать картинки с этой знаменитостью (например Putin (Путин)).

2. flickr api иногда высылает ссылки на несуществующие картинки. Таким образом, есть шанс, что у вас может не загрузится какая-то картинка. Можете проверить консоль на ошибку. Увидите, что это действительно flickr api выдал недействительную ссылку.

3. В выполненном задании есть незначительные расхождения с ТЗ, но по сути добавлена вся функциональность и в целом, каждый пункт успешно выполнен.

4. Дополнительный функционал: TODO List.

Итого: 160 баллов.

5. Выполнена адаптивность при width>=320px, однако этот пункт не оценивается.

===============
`);